In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
titanic = pd.read_csv("/Users/melisandecornetlichtfus/Desktop/Formation/DATA_python/train.csv")

In [2]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic.shape

(891, 12)

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
titanic.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [7]:
titanic.isna().sum() #Number of null per column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
print(titanic["Survived"]) #Print only col for Survived

In [ ]:
titanic.head(3) #Print only top 3 rows

In [ ]:
titanic.tail(5) #Print bottom 5 rows

In [ ]:
titanic.Embarked.nunique()

In [ ]:
titanic.SibSp.unique()

In [ ]:
titanic.SibSp.nunique()

In [ ]:
titanic.Survived.value_counts() #Combien on survecus

In [ ]:
titanic.Survived.value_counts(normalize = True) #Percentage of survivors

In [ ]:
# Babies under 1 years old
Newborn = titanic[titanic['Age'] < 1]
Newborn

In [ ]:
Newborn.Survived.value_counts(normalize=True) #Percentage of newborns who survived

In [ ]:
Premiere = titanic[titanic['Pclass']==1]
Premiere.Survived.value_counts(normalize=True)

In [ ]:
Troisieme = titanic[titanic['Pclass']==3]
Troisieme.Survived.value_counts(normalize=True)

In [ ]:
Deuxieme = titanic[titanic['Pclass']==2]
Deuxieme.Survived.value_counts(normalize=True)

In [ ]:
Troisieme.groupby('Age')['Survived'].sum()

In [ ]:
Premiere.groupby('Survived')['Age'].agg([np.mean,np.min,np.max])

In [ ]:
Troisieme.groupby('Survived')['Age'].agg([np.mean,np.min,np.max])

In [ ]:
Survivors = titanic[titanic["Survived"]==1]
Survivors

In [ ]:
Survivors.info

In [ ]:
Survivors.Age.unique

In [ ]:
Survivors.groupby('Pclass')['Age'].agg([np.mean,np.min,np.max,np.sum])

In [ ]:
titanic.Fare.nunique() #Nombre de prix de billets differents

In [ ]:
Survivors.Fare.nunique()

In [ ]:
titanic.groupby('Pclass')['Fare'].agg([np.mean,np.min,np.max,np.sum])

In [ ]:
titanic[titanic["Fare"]>500]

In [ ]:
t_max_fare = titanic[titanic["Fare"]>200]
t_max_fare

In [ ]:
t_min_fare = titanic[titanic["Fare"]<10] #Fares under 1$
t_min_fare

In [ ]:
res = pd.concat([t_max_fare,t_min_fare],axis=1)
res

In [ ]:
import seaborn as sns
import matplotlib as plt

In [11]:
f,ax = plt.subplots(1,2,figsize=(18,8))
titanic['Survived'].value_counts().plot.pie(explode=[0,0,1],autopct='%1,1f%%',ax=ax[0],shadow=True)
ax[0].set_title("Survived")

AttributeError: module 'matplotlib' has no attribute 'subplot'

In [ ]:
sns.countplot("Survived",data=data,ax=ax[1])

In [ ]:
sns.countplot(titanic=titanic,x='Survived')

In [ ]:
pd.crosstab(titanic.Pclass,titanic.Survived,margins=True).style.background_gradient(cmap='summer_r')

In [ ]:
# Correlation matrix